_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПараметрыВыполненияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПараметрыВыполненияРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Утверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УтверждениеКалендарногоПланаГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УтверждениеКалендарногоПланаГрафика</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВерсииПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыУтвержденияКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарнаяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПараметрыВыполненияРабот/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Отменяет утверждение календарного плана-графика.
//
// Параметры:
//  ДокументСсылка  – ссылка на план-график;
//  Отказ           – признак наличия ошибок.
//
Процедура ОтменитьПризнакУтверждения(ДокументСсылка, Отказ = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТаблицаЗаписей = ПолучитьТаблицуЗаписей(ДокументСсылка);	
	
	Для Каждого мДанныеЗаписи Из ТаблицаЗаписей Цикл
		
		НаборЗаписей = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(мДанныеЗаписи.Период); 		
		НаборЗаписей.Отбор.Работа.Установить(мДанныеЗаписи.Работа);
		НаборЗаписей.Отбор.ВидПланирования.Установить(мДанныеЗаписи.ВидПланирования);
		НаборЗаписей.Отбор.Утверждена.Установить(Истина);
		
		// Очищаем утвержденные записи
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НаборЗаписей = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(мДанныеЗаписи.Период); 		
		НаборЗаписей.Отбор.Работа.Установить(мДанныеЗаписи.Работа);
		НаборЗаписей.Отбор.ВидПланирования.Установить(мДанныеЗаписи.ВидПланирования);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, мДанныеЗаписи);
		НоваяЗапись.Утверждена = Ложь;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось отменить утверждение календарного план-графика %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ДокументСсылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.УСОERP_УтверждениеКалендарногоПланаГрафика, ДокументСсылка, ТекстСообщения);
			
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Функция  ПолучитьТаблицуЗаписей(ДокументСсылка) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы.Работа
	|ПОМЕСТИТЬ СписокРабот
	|ИЗ
	|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.Работы КАК УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы
	|ГДЕ
	|	УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Период,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа КАК Работа,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ВидПланирования,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Утверждена,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаОбъема,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.НачалоРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОкончаниеРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ДлительностьПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаДлительности,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.АвторИзменения
	|ИЗ
	|	РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
	|			,
	|			Работа.Владелец.Владелец = &ОбъектСтроительства
	|				И Работа.Владелец = &СценарийПланирования
	|				И Утверждена
	|				И Работа В
	|					(ВЫБРАТЬ
	|						СписокРабот.Работа
	|					ИЗ
	|						СписокРабот КАК СписокРабот)) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Период,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ВидПланирования,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Утверждена,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаОбъема,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.НачалоРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОкончаниеРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ДлительностьПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаДлительности,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.АвторИзменения";
	
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	ДокументСсылка.ОбъектСтроительства);
	Запрос.УстановитьПараметр("СценарийПланирования", 	ДокументСсылка.СценарийПланирования);
	Запрос.УстановитьПараметр("Ссылка", 				ДокументСсылка);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
